tutorials/ocmfMassTransferDns/NaCl_nG19_C01_P30_J60_Lx5_Ly2_Lz25/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    membrane
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    yMinus
    {
        type            cyclic;
    }
    yPlus
    {
        type            cyclic;
    }
    zMinus
    {
        type            cyclic;
    }
    zPlus
    {
        type            cyclic;
    }
}


// ************************************************************************* //
